[
    {
        "id": 1,
        "name": "Adwoa Boakye Dankwa",
        "details": "Valedictorian, Non-Academiv Awards : Leadership, SP; BS - Mathematics, Chemistry, ESS, French, Economics, Digital Society",
        "image": "assets/images/students/adwoa.jpg",
        "NoA": "8",
        "message": "Morgan has been my home away from home for the past three years and it’s been a rollercoaster of emotions and life-changing lessons. When I arrived in 2021, I was a wide-eyed newbie ready to explore the world. Today, Morgan has unleashed my inner creativity, innovation, focus, and resilience. I’ve pushed boundaries, forged lifelong friendships and had an absolute blast! My Morgan adventure has been an epic journey, and I wouldn’t trade it for anything!"
    },
    {
        "id": 2,
        "name": "Harriet Yayra Boven Fiahagbe",
        "details": "Best Student - Business Management, Global Politics; Non-Academic Awards : Creativity, MICS Special Award, Handball",
        "image": "assets/images/students/yayra.jpg",
        "NoA": "6",
        "message": "My six-year stay at MICS was transformative, shaping my tenacious spirit and strong bonds. The rigorous academics brought many struggles yet I was able to conquer them. Extracurriculars provided balance; leading me to captaincy of the girls’ team despite being petite of which I gained the name of pocket size. Now, I carry resilience, cherished memories and confidence that my independence will ensure I conquer the world regardless of my stature."
    },
    {
        "id": 3,
        "name": "Adwoa Adoma Amoo",
        "details": "Non-Academic Awards : Most Talented, Football, Volleyball , Basketball, Tennis",
        "image": "assets/images/students/adwoa_amoo.jpg",
        "NoA": "5",
        "message": "Sometimes the best way isn’t the easy way and that is one thing I can say about MICS. Though it is saddening to leave MICS, I look forward to starting a new chapter. I am forever glad to have come to this school and build lifelong relationships. MICS has imbibed in my great skills and values and for that I’m forever grateful. Siuuuuuuu!!"
    },
    {
        "id": 4,
        "name": "Betty Ewornam Agbovi",
        "details": "Most Outstanding Boarding Student",
        "image": "assets/images/students/betty.jpg",
        "NoA": "1",
        "message": "Ladies come down for roll-call.” I know I’m going to miss saying this. An incredible four-year journey has regrettably come to an end. MICS has taught me not only the realities of the world but also the value of community. MICS has prepared me to be a lady and a leader with an unwavering passion for volleyball and football. It has shaped my path and pushed me to fulfill my potential. This was a historic transition, marking the end of one era and the beginning of another."
    },
    {
        "id": 5,
        "name": "Vanessa Osafo- Kwaako",
        "details": "Best student - Biology, Literature(SL)",
        "image": "assets/images/students/vanessa.jpg",
        "NoA": "2",
        "message": "Morgan International Community School nurtured my passion from childhood. With the help of my teachers, I learned many things including violin.Lifelong school friends became my biggest supporters, cheering me on every step of the way. I’m grateful for MICS’s nurturing environment, teachers imparting invaluable skills, and friends’ steadfast encouragement. They allowed my truest talented self to flourish in these past eight years."
    },
    {
        "id": 6,
        "name": "Robert Kobina Ewur Baiden",
        "details": "",
        "image": "assets/images/students/robert.jpg",
        "NoA": "-",
        "message": "MICS provided a truly metamorphic experience, molding me comprehensively. Teachers guided my academics as coaches refined my athletic skills and values.Roommates and classmates became unbreakable support systems boosting my confidence. Morgan honed my abilities, fortified my self-assurance, and instilled a spirit of service in me. I’m grateful for the nurturing environment that empowered my personal growth alongside wonderful people. "
    },
    {
        "id": 7,
        "name": "Nana Kwame Okatakyie Nyamekye",
        "details": "Non-Academic Awards : Handball , Track & Field, Most talented",
        "image": "assets/images/students/nana.jpg",
        "NoA": "3",
        "message": "My life in Morgan has been a remarkable one. Although I was here for two years, there are a lot of things I achieved. These include placing second in football (ISSAG), winning 1st place in the 100meter race and 2nd in the 200meter race at athletics (ISSAG) MICS is one place I can’t forget, it has taught me a lot and I am grateful for that. "
    },
    {
        "id": 8,
        "name": "Molly Candis Kissi",
        "details": "",
        "image": "assets/images/students/molly.jpg",
        "NoA": "-",
        "message": "My four years were productive, as I spent my first few months learning how to wash, mop, and even write! It has not been easy. Endlessly grateful to my teachers and loyal friends, who guided and believed in my potential. My pillars of support were always there for me, through good and devastating times. As a student of Morgan, embrace all situations because they will help develop your character. Accept difficulties as part of your growth and journey. Personally, MICS is not just a school but a home where I learnt great lessons."
    },
    {
        "id": 9,
        "name": "Janelle Eyram Fiagbenu",
        "details": "",
        "image": "assets/images/students/janelle.jpg",
        "NoA": "-",
        "message": "From creating priceless memories to forming lifetime bonds, my experience in MICS has simply been thrilling. From those first tentative steps on campus to the confident stride of my final year, an undisputed transformation has taken place and empowered me to be a global leader. Mere school mates became an unbreakable support system. Dedicated teachers fueled my passion, and stood by me through the challenge of studying two curricula at the same time."
    },
    {
        "id": 10,
        "name": "Roselyn Ama Edukoriba Forson",
        "details": "Non-Academic Awards : Resilience & Perseverance",
        "image": "assets/images/students/roselyn.jpg",
        "NoA": "2",
        "message": "My experience at Morgan International Community School has been a transformative journey. Reflecting on the challenges and difficulties I faced at MICS, particularly with my WASSCE, being given the opportunity to pursue the IBD programme was a dream come true. It was like winning the lottery, but with more essays and less cash. I can confidently say that my two year stay at MICS has endowed me the spirit of determination, resilience, and has shaped me into the person I am today."
    },
    {
        "id": 11,
        "name": "Frederick Makafui Kubunu",
        "details": "",
        "image": "assets/images/students/fredrick.jpg",
        "NoA": "-",
        "message": "My time at Morgan International Community School has been a transformative journey coupled with sdiscovery and growth. Immersed in a supportive environment that fosters individuality, I’ve learned to appreciate myself in new ways and embrace challenges to expand my intellect. Interacting with diverse classmates has enriched my understanding of the world, while my passion for football has flourished alongside a supportive community. "
    },
    {
        "id": 12,
        "name": "Elisa Sedinam Akosua Tettey",
        "details": "",
        "image": "assets/images/students/elisa.jpg",
        "NoA": "-",
        "message": "Morgan has been my home away from home for the past three years and it’s been a rollercoaster of emotions and life-changing lessons. When I arrived in 2021, I was a wide-eyed newbie ready to explore the world. Today, Morgan has unleashed my inner creativity, innovation, focus, and resilience. I’ve pushed boundaries, forged lifelong friendships and had an absolute blast! My Morgan adventure has been an epic journey, and I wouldn’t trade it for anything!"
    },
    {
        "id": 13,
        "name": "Cyril Akobanyam",
        "details": "Non-Academic Award - Football",
        "image": "assets/images/students/cyril.jpg",
        "NoA": "1",
        "message": "MICS has taught me invaluable life lessons and independence. It has nurtured my athletic talents, allowing me to thrive. I am forever grateful for the love and support from the staff, and my cherished friends. The memories forged will remain etched in my heart as I move forward."
    },
    {
        "id": 14,
        "name": "Caleb Nene Awaitey",
        "details": "Non-Academic Awards - Service Project",
        "image": "assets/images/students/caleb.jpg",
        "NoA": "1",
        "message": "From a wide-eyed grade 6 student to a confident grade 12 graduate, MICS has been the backdrop to my transformative years. Grade 12 stood out as the most amazing year at MICS. I’m grateful for the amazing friends I made. Our teachers were outstanding, supportive and challenged us every step of the way. Though the road had its bumps, MICS has taught me resilience and adguately prepared me for what lies ahead."
    },
    {
        "id": 15,
        "name": "Boafo Tumfuo Duah",
        "details": "Non-Academic Awards : Mentorship, Best Dressed, Best behaved, Volleyball",
        "image": "assets/images/students/boafo.jpg",
        "NoA": "4",
        "message": "My journey at MICS was truly life-altering. Immersed in a rich tapestry of cultures, I underwent deep self-reflection and embraced diverse perspectives. Rigorous academics pushed me to expand my critical thinking abilities, while extracurricular activitics like basketball, volleyball and music allowed me to forge key aspects of my character. Through music, in particular, I found a nurturing environment to explore my passion and perform confidently on stage."
    },
    {
        "id": 16,
        "name": "Benjamin Kwamena Owusu",
        "details": "",
        "image": "assets/images/students/benji.jpg",
        "NoA": "-",
        "message": "For eight cherished years, MICS was my home; an experience I wouldn’t trade for anything. MICS nurtured my athletic abilities, allowing me to thrive as a football captain, while enhancing my academic growth. Lifelong memories were forged through laughter, challenges triumphantly overcome, and profound self-discovery within these nurturing walls. The invaluable guidance and support will forever remain in my grateful heart."
    },
    {
        "id": 17,
        "name": "Adeline Mary Seyiram Houadjeto",
        "details": "Best Stduent - Literature(HL),  Non-Academic Awards : Service Project, Best Behaved",
        "image": "assets/images/students/adeline.jpg",
        "NoA": "3",
        "message": "My experience at MICS is one I’d never forget. Most of the people were incredibly supportive. I can confidently say that my four years here have grown and shaped me in ways I never imagined. Even though there were some ups and downs, I wouldn’t trade it for anything in the world. Glad I made it through."
    },
    {
        "id": 18,
        "name": "Ekow Plange",
        "details": "Non-Academic Award : Basketball",
        "image": "assets/images/students/ekow.jpg",
        "NoA": "1",
        "message": "Chale!! That be hard. My time at MICS has finally come to an end. Being in MICS for three years has been quite challenging. Reminiscing on the difficult times I had with both academic and extracurricular activities, I can now say that all the struggles were worth it. I can confidently say that my three-year stay in MICS was filled with both pleasant and seemingly unpleasant memories that will stay with me forever. MICS has taught me to overcome adversity and equipped me with the tools I need to be successful. It has been great, but unfortunately I gotta go!! "
    },
    {
        "id": 19,
        "name": "Claude Kwaku Fianyeku",
        "details": "Best Student - Physics, Visual Art",
        "image": "assets/images/students/claude.jpg",
        "NoA": "2",
        "message": "Morgan has been my home away from home for the past three years and it’s been a rollercoaster of emotions and life-changing lessons. When I arrived in 2021, I was a wide-eyed newbie ready to explore the world. Today, Morgan has unleashed my inner creativity, innovation, focus, and resilience. I’ve pushed boundaries, forged lifelong friendships and had an absolute blast! My Morgan adventure has been an epic journey, and I wouldn’t trade it for anything!"
    }
]